script/send-request.sh

#!/bin/sh
curl -d "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Header><wsse:Security soap:mustUnderstand=\"1\" xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"><wsse:UsernameToken xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\" wsu:Id=\"UsernameToken-0e16ab28-14e2-469c-8ed6-ff8a5de3b553\"><wsse:Username>kermit</wsse:Username><wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">thefrog</wsse:Password></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body><ns2:sayHello xmlns:ns2=\"http://www.jboss.org/jbossws/ws-extensions/wssecuritypolicy\"/></soap:Body></soap:Envelope>" http://localhost:8080/jaxws-samples-wsse-policy-username-jaas

